* Count number of jobs in queue
#+BEGIN_SRC python :results output
from torque import PBS
pbs = PBS()
pbs.fastpoll()
print '{0} jobs are in the queue.'.format(len(pbs))
#+END_SRC

#+RESULTS:
: 309 jobs are in the queue.




#+BEGIN_SRC python :results output
from torque import PBS
pbs = PBS()
print pbs.ruptime()
#+END_SRC

#+RESULTS:

* Find jobs on a certain node
#+BEGIN_SRC python :results output
from torque import PBS
pbs = PBS()
pbs.poll()

nodelist = ['n9/']

for job in pbs:
  for node in nodelist:

      if node in job.get('exec_host',[]):
          print '%(euser)-12s %(Job Id)30s %(exec_host)s' % job
#+END_SRC

#+RESULTS:
#+begin_example
mcurnan      545990.gilgamesh.cheme.cmu.edu n9/8+n9/7+n9/6+n9/5+n9/4+n9/3+n9/2+n9/1+n9/0
mcurnan      545992.gilgamesh.cheme.cmu.edu n9/26+n9/25+n9/24+n9/23+n9/22+n9/21+n9/20+n9/19+n9/18
zhongnanxu   546035.gilgamesh.cheme.cmu.edu n9/30+n9/29+n9/28+n9/27
zhongnanxu   546070.gilgamesh.cheme.cmu.edu n9/12+n9/11+n9/10+n9/9
zhongnanxu   546071.gilgamesh.cheme.cmu.edu n9/16+n9/15+n9/14+n9/13
kkarimi      546645.gilgamesh.cheme.cmu.edu n9/31
kkarimi      546651.gilgamesh.cheme.cmu.edu n9/17
kkarimi      546664.gilgamesh.cheme.cmu.edu n9/17
kkarimi      546665.gilgamesh.cheme.cmu.edu n9/31
kkarimi      546673.gilgamesh.cheme.cmu.edu n9/17
kkarimi      546674.gilgamesh.cheme.cmu.edu n9/31
kkarimi      546682.gilgamesh.cheme.cmu.edu n9/17
kkarimi      546683.gilgamesh.cheme.cmu.edu n9/31
#+end_example

* pbsnodes
#+BEGIN_SRC python :results output
from torque import PBS
pbs = PBS()
print pbs.pbsnodes()
#+END_SRC

#+RESULTS:
: (0, 'n0\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/546019.gilgamesh.cheme.cmu.edu, 1/546019.gilgamesh.cheme.cmu.edu, 2/546019.gilgamesh.cheme.cmu.edu, 3/546019.gilgamesh.cheme.cmu.edu, 4/546086.gilgamesh.cheme.cmu.edu, 5/546086.gilgamesh.cheme.cmu.edu, 6/546086.gilgamesh.cheme.cmu.edu, 7/546086.gilgamesh.cheme.cmu.edu, 8/546019.gilgamesh.cheme.cmu.edu, 9/546019.gilgamesh.cheme.cmu.edu, 10/546019.gilgamesh.cheme.cmu.edu, 11/546019.gilgamesh.cheme.cmu.edu, 12/546087.gilgamesh.cheme.cmu.edu, 13/546087.gilgamesh.cheme.cmu.edu, 14/546087.gilgamesh.cheme.cmu.edu, 15/546087.gilgamesh.cheme.cmu.edu, 16/546088.gilgamesh.cheme.cmu.edu, 17/546088.gilgamesh.cheme.cmu.edu, 18/546088.gilgamesh.cheme.cmu.edu, 19/546088.gilgamesh.cheme.cmu.edu, 20/546019.gilgamesh.cheme.cmu.edu, 21/546019.gilgamesh.cheme.cmu.edu, 22/546019.gilgamesh.cheme.cmu.edu, 23/546019.gilgamesh.cheme.cmu.edu, 24/546077.gilgamesh.cheme.cmu.edu, 25/546077.gilgamesh.cheme.cmu.edu, 26/546077.gilgamesh.cheme.cmu.edu, 27/546077.gilgamesh.cheme.cmu.edu, 28/546078.gilgamesh.cheme.cmu.edu, 29/546078.gilgamesh.cheme.cmu.edu, 30/546078.gilgamesh.cheme.cmu.edu, 31/546078.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n0 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=47551 47707 47717 50360 50400 60545 60553 60567,nsessions=8,nusers=2,idletime=1036383,totmem=271463292kb,availmem=231751152kb,physmem=263639680kb,ncpus=32,loadave=20.81,netload=165940341923,state=free,jobs=546019.gilgamesh.cheme.cmu.edu 546077.gilgamesh.cheme.cmu.edu 546078.gilgamesh.cheme.cmu.edu 546086.gilgamesh.cheme.cmu.edu 546087.gilgamesh.cheme.cmu.edu 546088.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609212\n\nn1\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/543153.gilgamesh.cheme.cmu.edu, 1/543153.gilgamesh.cheme.cmu.edu, 2/543153.gilgamesh.cheme.cmu.edu, 3/543153.gilgamesh.cheme.cmu.edu, 4/543153.gilgamesh.cheme.cmu.edu, 5/543153.gilgamesh.cheme.cmu.edu, 6/543153.gilgamesh.cheme.cmu.edu, 7/543153.gilgamesh.cheme.cmu.edu, 8/543153.gilgamesh.cheme.cmu.edu, 9/543153.gilgamesh.cheme.cmu.edu, 10/543153.gilgamesh.cheme.cmu.edu, 11/543153.gilgamesh.cheme.cmu.edu, 12/543153.gilgamesh.cheme.cmu.edu, 13/543153.gilgamesh.cheme.cmu.edu, 14/543153.gilgamesh.cheme.cmu.edu, 15/543153.gilgamesh.cheme.cmu.edu, 16/543153.gilgamesh.cheme.cmu.edu, 17/543153.gilgamesh.cheme.cmu.edu, 18/543153.gilgamesh.cheme.cmu.edu, 19/543153.gilgamesh.cheme.cmu.edu, 20/543153.gilgamesh.cheme.cmu.edu, 21/543153.gilgamesh.cheme.cmu.edu, 22/543153.gilgamesh.cheme.cmu.edu, 23/543153.gilgamesh.cheme.cmu.edu, 24/543153.gilgamesh.cheme.cmu.edu, 25/543153.gilgamesh.cheme.cmu.edu, 26/543153.gilgamesh.cheme.cmu.edu, 27/543153.gilgamesh.cheme.cmu.edu, 28/543153.gilgamesh.cheme.cmu.edu, 29/543153.gilgamesh.cheme.cmu.edu, 30/543153.gilgamesh.cheme.cmu.edu, 31/543153.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n1 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=56313,nsessions=1,nusers=1,idletime=1036330,totmem=271463292kb,availmem=271076212kb,physmem=263639680kb,ncpus=32,loadave=32.00,netload=43717313004,state=free,jobs=543153.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609215\n\nn2\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541317.gilgamesh.cheme.cmu.edu, 1/541317.gilgamesh.cheme.cmu.edu, 2/541317.gilgamesh.cheme.cmu.edu, 3/541317.gilgamesh.cheme.cmu.edu, 4/541317.gilgamesh.cheme.cmu.edu, 5/541317.gilgamesh.cheme.cmu.edu, 6/541317.gilgamesh.cheme.cmu.edu, 7/541317.gilgamesh.cheme.cmu.edu, 8/541317.gilgamesh.cheme.cmu.edu, 9/541317.gilgamesh.cheme.cmu.edu, 10/541317.gilgamesh.cheme.cmu.edu, 11/541317.gilgamesh.cheme.cmu.edu, 12/541317.gilgamesh.cheme.cmu.edu, 13/541317.gilgamesh.cheme.cmu.edu, 14/541317.gilgamesh.cheme.cmu.edu, 15/541317.gilgamesh.cheme.cmu.edu, 16/541317.gilgamesh.cheme.cmu.edu, 17/541317.gilgamesh.cheme.cmu.edu, 18/541317.gilgamesh.cheme.cmu.edu, 19/541317.gilgamesh.cheme.cmu.edu, 20/541317.gilgamesh.cheme.cmu.edu, 21/541317.gilgamesh.cheme.cmu.edu, 22/541317.gilgamesh.cheme.cmu.edu, 23/541317.gilgamesh.cheme.cmu.edu, 24/541317.gilgamesh.cheme.cmu.edu, 25/541317.gilgamesh.cheme.cmu.edu, 26/541317.gilgamesh.cheme.cmu.edu, 27/541317.gilgamesh.cheme.cmu.edu, 28/541317.gilgamesh.cheme.cmu.edu, 29/541317.gilgamesh.cheme.cmu.edu, 30/541317.gilgamesh.cheme.cmu.edu, 31/541317.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n2 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=6216,nsessions=1,nusers=1,idletime=1036972,totmem=139277700kb,availmem=138966992kb,physmem=131454088kb,ncpus=32,loadave=32.00,netload=11585312090,state=free,jobs=541317.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609212\n\nn3\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541223.gilgamesh.cheme.cmu.edu, 1/541223.gilgamesh.cheme.cmu.edu, 2/541223.gilgamesh.cheme.cmu.edu, 3/541223.gilgamesh.cheme.cmu.edu, 4/541223.gilgamesh.cheme.cmu.edu, 5/541223.gilgamesh.cheme.cmu.edu, 6/541223.gilgamesh.cheme.cmu.edu, 7/541223.gilgamesh.cheme.cmu.edu, 8/541223.gilgamesh.cheme.cmu.edu, 9/541223.gilgamesh.cheme.cmu.edu, 10/541223.gilgamesh.cheme.cmu.edu, 11/541223.gilgamesh.cheme.cmu.edu, 12/541223.gilgamesh.cheme.cmu.edu, 13/541223.gilgamesh.cheme.cmu.edu, 14/541223.gilgamesh.cheme.cmu.edu, 15/541223.gilgamesh.cheme.cmu.edu, 16/541223.gilgamesh.cheme.cmu.edu, 17/541223.gilgamesh.cheme.cmu.edu, 18/541223.gilgamesh.cheme.cmu.edu, 19/541223.gilgamesh.cheme.cmu.edu, 20/541223.gilgamesh.cheme.cmu.edu, 21/541223.gilgamesh.cheme.cmu.edu, 22/541223.gilgamesh.cheme.cmu.edu, 23/541223.gilgamesh.cheme.cmu.edu, 24/541223.gilgamesh.cheme.cmu.edu, 25/541223.gilgamesh.cheme.cmu.edu, 26/541223.gilgamesh.cheme.cmu.edu, 27/541223.gilgamesh.cheme.cmu.edu, 28/541223.gilgamesh.cheme.cmu.edu, 29/541223.gilgamesh.cheme.cmu.edu, 30/541223.gilgamesh.cheme.cmu.edu, 31/541223.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n3 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=78977,nsessions=1,nusers=1,idletime=1036674,totmem=139277700kb,availmem=139014420kb,physmem=131454088kb,ncpus=32,loadave=32.00,netload=2019493624,state=free,jobs=541223.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609248\n\nn4\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541316.gilgamesh.cheme.cmu.edu, 1/541316.gilgamesh.cheme.cmu.edu, 2/541316.gilgamesh.cheme.cmu.edu, 3/541316.gilgamesh.cheme.cmu.edu, 4/541316.gilgamesh.cheme.cmu.edu, 5/541316.gilgamesh.cheme.cmu.edu, 6/541316.gilgamesh.cheme.cmu.edu, 7/541316.gilgamesh.cheme.cmu.edu, 8/541316.gilgamesh.cheme.cmu.edu, 9/541316.gilgamesh.cheme.cmu.edu, 10/541316.gilgamesh.cheme.cmu.edu, 11/541316.gilgamesh.cheme.cmu.edu, 12/541316.gilgamesh.cheme.cmu.edu, 13/541316.gilgamesh.cheme.cmu.edu, 14/541316.gilgamesh.cheme.cmu.edu, 15/541316.gilgamesh.cheme.cmu.edu, 16/541316.gilgamesh.cheme.cmu.edu, 17/541316.gilgamesh.cheme.cmu.edu, 18/541316.gilgamesh.cheme.cmu.edu, 19/541316.gilgamesh.cheme.cmu.edu, 20/541316.gilgamesh.cheme.cmu.edu, 21/541316.gilgamesh.cheme.cmu.edu, 22/541316.gilgamesh.cheme.cmu.edu, 23/541316.gilgamesh.cheme.cmu.edu, 24/541316.gilgamesh.cheme.cmu.edu, 25/541316.gilgamesh.cheme.cmu.edu, 26/541316.gilgamesh.cheme.cmu.edu, 27/541316.gilgamesh.cheme.cmu.edu, 28/541316.gilgamesh.cheme.cmu.edu, 29/541316.gilgamesh.cheme.cmu.edu, 30/541316.gilgamesh.cheme.cmu.edu, 31/541316.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n4 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=6013,nsessions=1,nusers=1,idletime=1036137,totmem=139277700kb,availmem=139012924kb,physmem=131454088kb,ncpus=32,loadave=31.99,netload=2381989274,state=free,jobs=541316.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609213\n\nn5\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/546083.gilgamesh.cheme.cmu.edu, 1/546083.gilgamesh.cheme.cmu.edu, 2/546083.gilgamesh.cheme.cmu.edu, 3/546083.gilgamesh.cheme.cmu.edu, 4/546084.gilgamesh.cheme.cmu.edu, 5/546084.gilgamesh.cheme.cmu.edu, 6/546084.gilgamesh.cheme.cmu.edu, 7/546084.gilgamesh.cheme.cmu.edu, 8/546085.gilgamesh.cheme.cmu.edu, 9/546085.gilgamesh.cheme.cmu.edu, 10/546085.gilgamesh.cheme.cmu.edu, 11/546085.gilgamesh.cheme.cmu.edu, 12/546017.gilgamesh.cheme.cmu.edu, 13/546017.gilgamesh.cheme.cmu.edu, 14/546017.gilgamesh.cheme.cmu.edu, 15/546017.gilgamesh.cheme.cmu.edu, 16/546017.gilgamesh.cheme.cmu.edu, 17/546017.gilgamesh.cheme.cmu.edu, 18/546017.gilgamesh.cheme.cmu.edu, 19/546017.gilgamesh.cheme.cmu.edu, 20/546017.gilgamesh.cheme.cmu.edu, 21/546017.gilgamesh.cheme.cmu.edu, 22/546017.gilgamesh.cheme.cmu.edu, 23/546017.gilgamesh.cheme.cmu.edu, 24/546075.gilgamesh.cheme.cmu.edu, 25/546075.gilgamesh.cheme.cmu.edu, 26/546075.gilgamesh.cheme.cmu.edu, 27/546075.gilgamesh.cheme.cmu.edu, 28/546076.gilgamesh.cheme.cmu.edu, 29/546076.gilgamesh.cheme.cmu.edu, 30/546076.gilgamesh.cheme.cmu.edu, 31/546076.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n5 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=45055 45208 45218 50020 50034 59904 59915 59929,nsessions=8,nusers=2,idletime=1037172,totmem=139277700kb,availmem=111294892kb,physmem=131454088kb,ncpus=32,loadave=21.01,netload=127334186829,state=free,jobs=546017.gilgamesh.cheme.cmu.edu 546075.gilgamesh.cheme.cmu.edu 546076.gilgamesh.cheme.cmu.edu 546083.gilgamesh.cheme.cmu.edu 546084.gilgamesh.cheme.cmu.edu 546085.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609220\n\nn6\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/544351.gilgamesh.cheme.cmu.edu, 1/546015.gilgamesh.cheme.cmu.edu, 2/546015.gilgamesh.cheme.cmu.edu, 3/546015.gilgamesh.cheme.cmu.edu, 4/546015.gilgamesh.cheme.cmu.edu, 5/546015.gilgamesh.cheme.cmu.edu, 6/546015.gilgamesh.cheme.cmu.edu, 7/546015.gilgamesh.cheme.cmu.edu, 8/546015.gilgamesh.cheme.cmu.edu, 9/546015.gilgamesh.cheme.cmu.edu, 10/546015.gilgamesh.cheme.cmu.edu, 11/546015.gilgamesh.cheme.cmu.edu, 12/546015.gilgamesh.cheme.cmu.edu, 13/546012.gilgamesh.cheme.cmu.edu, 14/546012.gilgamesh.cheme.cmu.edu, 15/546012.gilgamesh.cheme.cmu.edu, 16/546012.gilgamesh.cheme.cmu.edu, 17/546012.gilgamesh.cheme.cmu.edu, 18/546012.gilgamesh.cheme.cmu.edu, 19/546012.gilgamesh.cheme.cmu.edu, 20/546012.gilgamesh.cheme.cmu.edu, 21/546012.gilgamesh.cheme.cmu.edu, 22/546012.gilgamesh.cheme.cmu.edu, 23/546012.gilgamesh.cheme.cmu.edu, 24/546012.gilgamesh.cheme.cmu.edu, 25/546074.gilgamesh.cheme.cmu.edu, 26/546074.gilgamesh.cheme.cmu.edu, 27/546074.gilgamesh.cheme.cmu.edu, 28/546074.gilgamesh.cheme.cmu.edu, 29/546677.gilgamesh.cheme.cmu.edu, 30/546684.gilgamesh.cheme.cmu.edu, 31/546685.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n6 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=2330 3109 8568 8721 8731 30383 30536 30546 49860 61282,nsessions=10,nusers=4,idletime=1036345,totmem=139277700kb,availmem=133175596kb,physmem=131454088kb,ncpus=32,loadave=9.67,netload=88299592672,state=free,jobs=544351.gilgamesh.cheme.cmu.edu 546012.gilgamesh.cheme.cmu.edu 546015.gilgamesh.cheme.cmu.edu 546074.gilgamesh.cheme.cmu.edu 546677.gilgamesh.cheme.cmu.edu 546684.gilgamesh.cheme.cmu.edu 546685.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609214\n\nn7\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/545996.gilgamesh.cheme.cmu.edu, 1/545996.gilgamesh.cheme.cmu.edu, 2/545996.gilgamesh.cheme.cmu.edu, 3/545996.gilgamesh.cheme.cmu.edu, 4/545996.gilgamesh.cheme.cmu.edu, 5/545996.gilgamesh.cheme.cmu.edu, 6/545996.gilgamesh.cheme.cmu.edu, 7/545996.gilgamesh.cheme.cmu.edu, 8/545996.gilgamesh.cheme.cmu.edu, 9/545996.gilgamesh.cheme.cmu.edu, 10/545996.gilgamesh.cheme.cmu.edu, 11/545996.gilgamesh.cheme.cmu.edu, 12/545997.gilgamesh.cheme.cmu.edu, 13/545997.gilgamesh.cheme.cmu.edu, 14/545997.gilgamesh.cheme.cmu.edu, 15/545997.gilgamesh.cheme.cmu.edu, 16/546072.gilgamesh.cheme.cmu.edu, 17/546072.gilgamesh.cheme.cmu.edu, 18/546072.gilgamesh.cheme.cmu.edu, 19/546072.gilgamesh.cheme.cmu.edu, 20/545997.gilgamesh.cheme.cmu.edu, 21/545997.gilgamesh.cheme.cmu.edu, 22/545997.gilgamesh.cheme.cmu.edu, 23/545997.gilgamesh.cheme.cmu.edu, 24/545997.gilgamesh.cheme.cmu.edu, 25/545997.gilgamesh.cheme.cmu.edu, 26/545997.gilgamesh.cheme.cmu.edu, 27/545997.gilgamesh.cheme.cmu.edu, 28/546073.gilgamesh.cheme.cmu.edu, 29/546073.gilgamesh.cheme.cmu.edu, 30/546073.gilgamesh.cheme.cmu.edu, 31/546073.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n7 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=49611 49633 89192 89345 89355 89470 89629 89640,nsessions=8,nusers=2,idletime=1036499,totmem=139277700kb,availmem=134483420kb,physmem=131454088kb,ncpus=32,loadave=10.00,netload=104648601167,state=free,jobs=545996.gilgamesh.cheme.cmu.edu 545997.gilgamesh.cheme.cmu.edu 546072.gilgamesh.cheme.cmu.edu 546073.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609219\n\nn8\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/546036.gilgamesh.cheme.cmu.edu, 1/546036.gilgamesh.cheme.cmu.edu, 2/546036.gilgamesh.cheme.cmu.edu, 3/546036.gilgamesh.cheme.cmu.edu, 4/545993.gilgamesh.cheme.cmu.edu, 5/545993.gilgamesh.cheme.cmu.edu, 6/545993.gilgamesh.cheme.cmu.edu, 7/545993.gilgamesh.cheme.cmu.edu, 8/545993.gilgamesh.cheme.cmu.edu, 9/545993.gilgamesh.cheme.cmu.edu, 10/545993.gilgamesh.cheme.cmu.edu, 11/545993.gilgamesh.cheme.cmu.edu, 12/545993.gilgamesh.cheme.cmu.edu, 13/545994.gilgamesh.cheme.cmu.edu, 14/545994.gilgamesh.cheme.cmu.edu, 15/545994.gilgamesh.cheme.cmu.edu, 16/545994.gilgamesh.cheme.cmu.edu, 17/545994.gilgamesh.cheme.cmu.edu, 18/545994.gilgamesh.cheme.cmu.edu, 19/545994.gilgamesh.cheme.cmu.edu, 20/545994.gilgamesh.cheme.cmu.edu, 21/545994.gilgamesh.cheme.cmu.edu, 22/546079.gilgamesh.cheme.cmu.edu, 23/546079.gilgamesh.cheme.cmu.edu, 24/546079.gilgamesh.cheme.cmu.edu, 25/546079.gilgamesh.cheme.cmu.edu, 26/546080.gilgamesh.cheme.cmu.edu, 27/546080.gilgamesh.cheme.cmu.edu, 28/546080.gilgamesh.cheme.cmu.edu, 29/546080.gilgamesh.cheme.cmu.edu, 30/546679.gilgamesh.cheme.cmu.edu, 31/546681.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n8 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=52809 52817 61308 61352 70506 87378 87415 88758 88778 88923 88941,nsessions=11,nusers=3,idletime=1036982,totmem=73184908kb,availmem=39015884kb,physmem=65361296kb,ncpus=32,loadave=16.07,netload=67916929480,state=free,jobs=545993.gilgamesh.cheme.cmu.edu 545994.gilgamesh.cheme.cmu.edu 546036.gilgamesh.cheme.cmu.edu 546079.gilgamesh.cheme.cmu.edu 546080.gilgamesh.cheme.cmu.edu 546679.gilgamesh.cheme.cmu.edu 546681.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609241\n\nn9\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/545990.gilgamesh.cheme.cmu.edu, 1/545990.gilgamesh.cheme.cmu.edu, 2/545990.gilgamesh.cheme.cmu.edu, 3/545990.gilgamesh.cheme.cmu.edu, 4/545990.gilgamesh.cheme.cmu.edu, 5/545990.gilgamesh.cheme.cmu.edu, 6/545990.gilgamesh.cheme.cmu.edu, 7/545990.gilgamesh.cheme.cmu.edu, 8/545990.gilgamesh.cheme.cmu.edu, 9/546070.gilgamesh.cheme.cmu.edu, 10/546070.gilgamesh.cheme.cmu.edu, 11/546070.gilgamesh.cheme.cmu.edu, 12/546070.gilgamesh.cheme.cmu.edu, 13/546071.gilgamesh.cheme.cmu.edu, 14/546071.gilgamesh.cheme.cmu.edu, 15/546071.gilgamesh.cheme.cmu.edu, 16/546071.gilgamesh.cheme.cmu.edu, 17/546682.gilgamesh.cheme.cmu.edu, 18/545992.gilgamesh.cheme.cmu.edu, 19/545992.gilgamesh.cheme.cmu.edu, 20/545992.gilgamesh.cheme.cmu.edu, 21/545992.gilgamesh.cheme.cmu.edu, 22/545992.gilgamesh.cheme.cmu.edu, 23/545992.gilgamesh.cheme.cmu.edu, 24/545992.gilgamesh.cheme.cmu.edu, 25/545992.gilgamesh.cheme.cmu.edu, 26/545992.gilgamesh.cheme.cmu.edu, 27/546035.gilgamesh.cheme.cmu.edu, 28/546035.gilgamesh.cheme.cmu.edu, 29/546035.gilgamesh.cheme.cmu.edu, 30/546035.gilgamesh.cheme.cmu.edu, 31/546683.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n9 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=49408 49420 61395 67781 87281 87327 88948 88952 88981 88982,nsessions=10,nusers=3,idletime=353776,totmem=73184908kb,availmem=55048360kb,physmem=65361296kb,ncpus=32,loadave=15.95,netload=42071728523,state=free,jobs=545990.gilgamesh.cheme.cmu.edu 545992.gilgamesh.cheme.cmu.edu 546035.gilgamesh.cheme.cmu.edu 546070.gilgamesh.cheme.cmu.edu 546071.gilgamesh.cheme.cmu.edu 546682.gilgamesh.cheme.cmu.edu 546683.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609210\n\nn10\n     state = down,job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/546020.gilgamesh.cheme.cmu.edu, 1/546020.gilgamesh.cheme.cmu.edu, 2/546020.gilgamesh.cheme.cmu.edu, 3/546020.gilgamesh.cheme.cmu.edu, 4/543834.gilgamesh.cheme.cmu.edu, 5/543834.gilgamesh.cheme.cmu.edu, 6/543834.gilgamesh.cheme.cmu.edu, 7/543834.gilgamesh.cheme.cmu.edu, 8/543834.gilgamesh.cheme.cmu.edu, 9/546020.gilgamesh.cheme.cmu.edu, 10/543834.gilgamesh.cheme.cmu.edu, 11/546020.gilgamesh.cheme.cmu.edu, 12/546020.gilgamesh.cheme.cmu.edu, 13/546020.gilgamesh.cheme.cmu.edu, 14/546020.gilgamesh.cheme.cmu.edu, 15/546020.gilgamesh.cheme.cmu.edu, 16/543834.gilgamesh.cheme.cmu.edu, 17/543834.gilgamesh.cheme.cmu.edu, 18/543834.gilgamesh.cheme.cmu.edu, 19/543834.gilgamesh.cheme.cmu.edu, 20/543834.gilgamesh.cheme.cmu.edu, 21/543834.gilgamesh.cheme.cmu.edu, 22/543834.gilgamesh.cheme.cmu.edu, 23/543834.gilgamesh.cheme.cmu.edu, 24/543834.gilgamesh.cheme.cmu.edu, 25/543834.gilgamesh.cheme.cmu.edu, 26/546020.gilgamesh.cheme.cmu.edu, 27/546020.gilgamesh.cheme.cmu.edu, 28/546020.gilgamesh.cheme.cmu.edu, 29/546020.gilgamesh.cheme.cmu.edu, 30/546020.gilgamesh.cheme.cmu.edu, 31/546020.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n10 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=48711 65344,nsessions=2,nusers=2,idletime=1058708,totmem=73184908kb,availmem=96044kb,physmem=65361296kb,ncpus=32,loadave=28.05,netload=103670419332,state=free,jobs=543834.gilgamesh.cheme.cmu.edu 546020.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337606295\n\nn11\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541314.gilgamesh.cheme.cmu.edu, 1/541314.gilgamesh.cheme.cmu.edu, 2/541314.gilgamesh.cheme.cmu.edu, 3/541314.gilgamesh.cheme.cmu.edu, 4/541314.gilgamesh.cheme.cmu.edu, 5/541314.gilgamesh.cheme.cmu.edu, 6/541314.gilgamesh.cheme.cmu.edu, 7/541314.gilgamesh.cheme.cmu.edu, 8/541314.gilgamesh.cheme.cmu.edu, 9/541314.gilgamesh.cheme.cmu.edu, 10/541314.gilgamesh.cheme.cmu.edu, 11/541314.gilgamesh.cheme.cmu.edu, 12/541314.gilgamesh.cheme.cmu.edu, 13/541314.gilgamesh.cheme.cmu.edu, 14/541314.gilgamesh.cheme.cmu.edu, 15/541314.gilgamesh.cheme.cmu.edu, 16/541314.gilgamesh.cheme.cmu.edu, 17/541314.gilgamesh.cheme.cmu.edu, 18/541314.gilgamesh.cheme.cmu.edu, 19/541314.gilgamesh.cheme.cmu.edu, 20/541314.gilgamesh.cheme.cmu.edu, 21/541314.gilgamesh.cheme.cmu.edu, 22/541314.gilgamesh.cheme.cmu.edu, 23/541314.gilgamesh.cheme.cmu.edu, 24/541314.gilgamesh.cheme.cmu.edu, 25/541314.gilgamesh.cheme.cmu.edu, 26/541314.gilgamesh.cheme.cmu.edu, 27/541314.gilgamesh.cheme.cmu.edu, 28/541314.gilgamesh.cheme.cmu.edu, 29/541314.gilgamesh.cheme.cmu.edu, 30/541314.gilgamesh.cheme.cmu.edu, 31/541314.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n11 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=10655,nsessions=1,nusers=1,idletime=1037303,totmem=73184908kb,availmem=72924320kb,physmem=65361296kb,ncpus=32,loadave=32.00,netload=1908238045,state=free,jobs=541314.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609243\n\nn12\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541222.gilgamesh.cheme.cmu.edu, 1/541222.gilgamesh.cheme.cmu.edu, 2/541222.gilgamesh.cheme.cmu.edu, 3/541222.gilgamesh.cheme.cmu.edu, 4/541222.gilgamesh.cheme.cmu.edu, 5/541222.gilgamesh.cheme.cmu.edu, 6/541222.gilgamesh.cheme.cmu.edu, 7/541222.gilgamesh.cheme.cmu.edu, 8/541222.gilgamesh.cheme.cmu.edu, 9/541222.gilgamesh.cheme.cmu.edu, 10/541222.gilgamesh.cheme.cmu.edu, 11/541222.gilgamesh.cheme.cmu.edu, 12/541222.gilgamesh.cheme.cmu.edu, 13/541222.gilgamesh.cheme.cmu.edu, 14/541222.gilgamesh.cheme.cmu.edu, 15/541222.gilgamesh.cheme.cmu.edu, 16/541222.gilgamesh.cheme.cmu.edu, 17/541222.gilgamesh.cheme.cmu.edu, 18/541222.gilgamesh.cheme.cmu.edu, 19/541222.gilgamesh.cheme.cmu.edu, 20/541222.gilgamesh.cheme.cmu.edu, 21/541222.gilgamesh.cheme.cmu.edu, 22/541222.gilgamesh.cheme.cmu.edu, 23/541222.gilgamesh.cheme.cmu.edu, 24/541222.gilgamesh.cheme.cmu.edu, 25/541222.gilgamesh.cheme.cmu.edu, 26/541222.gilgamesh.cheme.cmu.edu, 27/541222.gilgamesh.cheme.cmu.edu, 28/541222.gilgamesh.cheme.cmu.edu, 29/541222.gilgamesh.cheme.cmu.edu, 30/541222.gilgamesh.cheme.cmu.edu, 31/541222.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n12 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=78565,nsessions=1,nusers=1,idletime=1062844,totmem=73184908kb,availmem=72916120kb,physmem=65361296kb,ncpus=32,loadave=32.00,netload=2058189014,state=free,jobs=541222.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609234\n\nn13\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541224.gilgamesh.cheme.cmu.edu, 1/541224.gilgamesh.cheme.cmu.edu, 2/541224.gilgamesh.cheme.cmu.edu, 3/541224.gilgamesh.cheme.cmu.edu, 4/541224.gilgamesh.cheme.cmu.edu, 5/541224.gilgamesh.cheme.cmu.edu, 6/541224.gilgamesh.cheme.cmu.edu, 7/541224.gilgamesh.cheme.cmu.edu, 8/541224.gilgamesh.cheme.cmu.edu, 9/541224.gilgamesh.cheme.cmu.edu, 10/541224.gilgamesh.cheme.cmu.edu, 11/541224.gilgamesh.cheme.cmu.edu, 12/541224.gilgamesh.cheme.cmu.edu, 13/541224.gilgamesh.cheme.cmu.edu, 14/541224.gilgamesh.cheme.cmu.edu, 15/541224.gilgamesh.cheme.cmu.edu, 16/541224.gilgamesh.cheme.cmu.edu, 17/541224.gilgamesh.cheme.cmu.edu, 18/541224.gilgamesh.cheme.cmu.edu, 19/541224.gilgamesh.cheme.cmu.edu, 20/541224.gilgamesh.cheme.cmu.edu, 21/541224.gilgamesh.cheme.cmu.edu, 22/541224.gilgamesh.cheme.cmu.edu, 23/541224.gilgamesh.cheme.cmu.edu, 24/541224.gilgamesh.cheme.cmu.edu, 25/541224.gilgamesh.cheme.cmu.edu, 26/541224.gilgamesh.cheme.cmu.edu, 27/541224.gilgamesh.cheme.cmu.edu, 28/541224.gilgamesh.cheme.cmu.edu, 29/541224.gilgamesh.cheme.cmu.edu, 30/541224.gilgamesh.cheme.cmu.edu, 31/541224.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n13 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=27238,nsessions=1,nusers=1,idletime=1037173,totmem=73184908kb,availmem=72750436kb,physmem=65361296kb,ncpus=32,loadave=32.00,netload=32216450448,state=free,jobs=541224.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609233\n\nn14\n     state = free\n     np = 32\n     ntype = cluster\n     jobs = 0/545987.gilgamesh.cheme.cmu.edu, 1/545987.gilgamesh.cheme.cmu.edu, 2/545987.gilgamesh.cheme.cmu.edu, 3/545987.gilgamesh.cheme.cmu.edu, 4/545987.gilgamesh.cheme.cmu.edu, 5/545987.gilgamesh.cheme.cmu.edu, 6/545987.gilgamesh.cheme.cmu.edu, 7/545987.gilgamesh.cheme.cmu.edu, 8/545987.gilgamesh.cheme.cmu.edu, 9/546041.gilgamesh.cheme.cmu.edu, 10/546041.gilgamesh.cheme.cmu.edu, 11/546041.gilgamesh.cheme.cmu.edu, 12/546041.gilgamesh.cheme.cmu.edu, 13/546041.gilgamesh.cheme.cmu.edu, 14/546041.gilgamesh.cheme.cmu.edu, 15/546041.gilgamesh.cheme.cmu.edu, 16/546041.gilgamesh.cheme.cmu.edu, 17/546675.gilgamesh.cheme.cmu.edu, 18/546081.gilgamesh.cheme.cmu.edu, 19/546081.gilgamesh.cheme.cmu.edu, 20/546081.gilgamesh.cheme.cmu.edu, 21/546081.gilgamesh.cheme.cmu.edu, 22/546082.gilgamesh.cheme.cmu.edu, 23/546082.gilgamesh.cheme.cmu.edu, 24/546082.gilgamesh.cheme.cmu.edu, 25/546082.gilgamesh.cheme.cmu.edu, 26/546686.gilgamesh.cheme.cmu.edu, 27/546034.gilgamesh.cheme.cmu.edu, 28/546034.gilgamesh.cheme.cmu.edu, 29/546034.gilgamesh.cheme.cmu.edu, 30/546034.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n14 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=49259 57555 57563 61241 61473 67663 86806 88726 88898,nsessions=9,nusers=3,idletime=259840,totmem=73184908kb,availmem=44431892kb,physmem=65361296kb,ncpus=32,loadave=23.90,netload=43675943801,state=free,jobs=545987.gilgamesh.cheme.cmu.edu 546034.gilgamesh.cheme.cmu.edu 546041.gilgamesh.cheme.cmu.edu 546081.gilgamesh.cheme.cmu.edu 546082.gilgamesh.cheme.cmu.edu 546675.gilgamesh.cheme.cmu.edu 546686.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609230\n\nn15\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541315.gilgamesh.cheme.cmu.edu, 1/541315.gilgamesh.cheme.cmu.edu, 2/541315.gilgamesh.cheme.cmu.edu, 3/541315.gilgamesh.cheme.cmu.edu, 4/541315.gilgamesh.cheme.cmu.edu, 5/541315.gilgamesh.cheme.cmu.edu, 6/541315.gilgamesh.cheme.cmu.edu, 7/541315.gilgamesh.cheme.cmu.edu, 8/541315.gilgamesh.cheme.cmu.edu, 9/541315.gilgamesh.cheme.cmu.edu, 10/541315.gilgamesh.cheme.cmu.edu, 11/541315.gilgamesh.cheme.cmu.edu, 12/541315.gilgamesh.cheme.cmu.edu, 13/541315.gilgamesh.cheme.cmu.edu, 14/541315.gilgamesh.cheme.cmu.edu, 15/541315.gilgamesh.cheme.cmu.edu, 16/541315.gilgamesh.cheme.cmu.edu, 17/541315.gilgamesh.cheme.cmu.edu, 18/541315.gilgamesh.cheme.cmu.edu, 19/541315.gilgamesh.cheme.cmu.edu, 20/541315.gilgamesh.cheme.cmu.edu, 21/541315.gilgamesh.cheme.cmu.edu, 22/541315.gilgamesh.cheme.cmu.edu, 23/541315.gilgamesh.cheme.cmu.edu, 24/541315.gilgamesh.cheme.cmu.edu, 25/541315.gilgamesh.cheme.cmu.edu, 26/541315.gilgamesh.cheme.cmu.edu, 27/541315.gilgamesh.cheme.cmu.edu, 28/541315.gilgamesh.cheme.cmu.edu, 29/541315.gilgamesh.cheme.cmu.edu, 30/541315.gilgamesh.cheme.cmu.edu, 31/541315.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n15 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=10819,nsessions=1,nusers=1,idletime=1037072,totmem=73184908kb,availmem=72922228kb,physmem=65361296kb,ncpus=32,loadave=32.00,netload=1938807071,state=free,jobs=541315.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609244\n\nn16\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/541171.gilgamesh.cheme.cmu.edu, 1/541171.gilgamesh.cheme.cmu.edu, 2/541171.gilgamesh.cheme.cmu.edu, 3/541171.gilgamesh.cheme.cmu.edu, 4/541171.gilgamesh.cheme.cmu.edu, 5/541171.gilgamesh.cheme.cmu.edu, 6/541171.gilgamesh.cheme.cmu.edu, 7/541171.gilgamesh.cheme.cmu.edu, 8/541171.gilgamesh.cheme.cmu.edu, 9/541171.gilgamesh.cheme.cmu.edu, 10/541171.gilgamesh.cheme.cmu.edu, 11/541171.gilgamesh.cheme.cmu.edu, 12/541171.gilgamesh.cheme.cmu.edu, 13/541171.gilgamesh.cheme.cmu.edu, 14/541171.gilgamesh.cheme.cmu.edu, 15/541171.gilgamesh.cheme.cmu.edu, 16/541171.gilgamesh.cheme.cmu.edu, 17/541171.gilgamesh.cheme.cmu.edu, 18/541171.gilgamesh.cheme.cmu.edu, 19/541171.gilgamesh.cheme.cmu.edu, 20/541171.gilgamesh.cheme.cmu.edu, 21/541171.gilgamesh.cheme.cmu.edu, 22/541171.gilgamesh.cheme.cmu.edu, 23/541171.gilgamesh.cheme.cmu.edu, 24/541171.gilgamesh.cheme.cmu.edu, 25/541171.gilgamesh.cheme.cmu.edu, 26/541171.gilgamesh.cheme.cmu.edu, 27/541171.gilgamesh.cheme.cmu.edu, 28/541171.gilgamesh.cheme.cmu.edu, 29/541171.gilgamesh.cheme.cmu.edu, 30/541171.gilgamesh.cheme.cmu.edu, 31/541171.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n16 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=36508,nsessions=1,nusers=1,idletime=1036514,totmem=73184908kb,availmem=72819292kb,physmem=65361296kb,ncpus=32,loadave=32.00,netload=18173605940,state=free,jobs=541171.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609241\n\nn17\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/546013.gilgamesh.cheme.cmu.edu, 1/546013.gilgamesh.cheme.cmu.edu, 2/546013.gilgamesh.cheme.cmu.edu, 3/546013.gilgamesh.cheme.cmu.edu, 4/546013.gilgamesh.cheme.cmu.edu, 5/546013.gilgamesh.cheme.cmu.edu, 6/546013.gilgamesh.cheme.cmu.edu, 7/546013.gilgamesh.cheme.cmu.edu, 8/546013.gilgamesh.cheme.cmu.edu, 9/546013.gilgamesh.cheme.cmu.edu, 10/546013.gilgamesh.cheme.cmu.edu, 11/546013.gilgamesh.cheme.cmu.edu, 12/546016.gilgamesh.cheme.cmu.edu, 13/546016.gilgamesh.cheme.cmu.edu, 14/546016.gilgamesh.cheme.cmu.edu, 15/546016.gilgamesh.cheme.cmu.edu, 16/546016.gilgamesh.cheme.cmu.edu, 17/546016.gilgamesh.cheme.cmu.edu, 18/546016.gilgamesh.cheme.cmu.edu, 19/546016.gilgamesh.cheme.cmu.edu, 20/546016.gilgamesh.cheme.cmu.edu, 21/546016.gilgamesh.cheme.cmu.edu, 22/546016.gilgamesh.cheme.cmu.edu, 23/546016.gilgamesh.cheme.cmu.edu, 24/546040.gilgamesh.cheme.cmu.edu, 25/546040.gilgamesh.cheme.cmu.edu, 26/546040.gilgamesh.cheme.cmu.edu, 27/546033.gilgamesh.cheme.cmu.edu, 28/546033.gilgamesh.cheme.cmu.edu, 29/546033.gilgamesh.cheme.cmu.edu, 30/546033.gilgamesh.cheme.cmu.edu, 31/546040.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n17 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=13222 13375 13385 31319 31476 31486 49090 67588,nsessions=8,nusers=2,idletime=435254,totmem=73184908kb,availmem=24700756kb,physmem=65361296kb,ncpus=32,loadave=10.00,netload=44526967870,state=free,jobs=546033.gilgamesh.cheme.cmu.edu 546013.gilgamesh.cheme.cmu.edu 546016.gilgamesh.cheme.cmu.edu 546040.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609243\n\nn18\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/545980.gilgamesh.cheme.cmu.edu, 1/545980.gilgamesh.cheme.cmu.edu, 2/545980.gilgamesh.cheme.cmu.edu, 3/545980.gilgamesh.cheme.cmu.edu, 4/544892.gilgamesh.cheme.cmu.edu, 5/544925.gilgamesh.cheme.cmu.edu, 6/546014.gilgamesh.cheme.cmu.edu, 7/545980.gilgamesh.cheme.cmu.edu, 8/545980.gilgamesh.cheme.cmu.edu, 9/545980.gilgamesh.cheme.cmu.edu, 10/545980.gilgamesh.cheme.cmu.edu, 11/545980.gilgamesh.cheme.cmu.edu, 12/546038.gilgamesh.cheme.cmu.edu, 13/546038.gilgamesh.cheme.cmu.edu, 14/546038.gilgamesh.cheme.cmu.edu, 15/546038.gilgamesh.cheme.cmu.edu, 16/546039.gilgamesh.cheme.cmu.edu, 17/546039.gilgamesh.cheme.cmu.edu, 18/546039.gilgamesh.cheme.cmu.edu, 19/546039.gilgamesh.cheme.cmu.edu, 20/546680.gilgamesh.cheme.cmu.edu, 21/546014.gilgamesh.cheme.cmu.edu, 22/546014.gilgamesh.cheme.cmu.edu, 23/546014.gilgamesh.cheme.cmu.edu, 24/546014.gilgamesh.cheme.cmu.edu, 25/546014.gilgamesh.cheme.cmu.edu, 26/546014.gilgamesh.cheme.cmu.edu, 27/546014.gilgamesh.cheme.cmu.edu, 28/546014.gilgamesh.cheme.cmu.edu, 29/546014.gilgamesh.cheme.cmu.edu, 30/546014.gilgamesh.cheme.cmu.edu, 31/546014.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n18 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=20076 20235 20245 48803 48823 61342 79228 79230 81808 81963 81974 82556 82583,nsessions=13,nusers=4,idletime=1037121,totmem=73184908kb,availmem=32102236kb,physmem=65361296kb,ncpus=32,loadave=13.01,netload=129006363300,state=free,jobs=544892.gilgamesh.cheme.cmu.edu 544925.gilgamesh.cheme.cmu.edu 545980.gilgamesh.cheme.cmu.edu 546014.gilgamesh.cheme.cmu.edu 546038.gilgamesh.cheme.cmu.edu 546039.gilgamesh.cheme.cmu.edu 546680.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609243\n\nn19\n     state = job-exclusive\n     np = 32\n     ntype = cluster\n     jobs = 0/543154.gilgamesh.cheme.cmu.edu, 1/546018.gilgamesh.cheme.cmu.edu, 2/546018.gilgamesh.cheme.cmu.edu, 3/546018.gilgamesh.cheme.cmu.edu, 4/546018.gilgamesh.cheme.cmu.edu, 5/546018.gilgamesh.cheme.cmu.edu, 6/546018.gilgamesh.cheme.cmu.edu, 7/546018.gilgamesh.cheme.cmu.edu, 8/546018.gilgamesh.cheme.cmu.edu, 9/546018.gilgamesh.cheme.cmu.edu, 10/546421.gilgamesh.cheme.cmu.edu, 11/546018.gilgamesh.cheme.cmu.edu, 12/546018.gilgamesh.cheme.cmu.edu, 13/546018.gilgamesh.cheme.cmu.edu, 14/546678.gilgamesh.cheme.cmu.edu, 15/546037.gilgamesh.cheme.cmu.edu, 16/546037.gilgamesh.cheme.cmu.edu, 17/546037.gilgamesh.cheme.cmu.edu, 18/546037.gilgamesh.cheme.cmu.edu, 19/546007.gilgamesh.cheme.cmu.edu, 20/546007.gilgamesh.cheme.cmu.edu, 21/546007.gilgamesh.cheme.cmu.edu, 22/546007.gilgamesh.cheme.cmu.edu, 23/546007.gilgamesh.cheme.cmu.edu, 24/546007.gilgamesh.cheme.cmu.edu, 25/546007.gilgamesh.cheme.cmu.edu, 26/546007.gilgamesh.cheme.cmu.edu, 27/546007.gilgamesh.cheme.cmu.edu, 28/546007.gilgamesh.cheme.cmu.edu, 29/546007.gilgamesh.cheme.cmu.edu, 30/546007.gilgamesh.cheme.cmu.edu, 31/543155.gilgamesh.cheme.cmu.edu\n     status = opsys=linux,uname=Linux n19 2.6.18-164.15.1.el5.541g0000 #1 SMP Wed Mar 17 21:11:25 EDT 2010 x86_64,sessions=37479 45687 45840 45852 48781 58409 58562 58572 61297 91350 91352 91968 92346,nsessions=13,nusers=5,idletime=367021,totmem=73185820kb,availmem=29102560kb,physmem=65362208kb,ncpus=32,loadave=9.89,netload=55525453496,state=free,jobs=543154.gilgamesh.cheme.cmu.edu 543155.gilgamesh.cheme.cmu.edu 546007.gilgamesh.cheme.cmu.edu 546421.gilgamesh.cheme.cmu.edu 546018.gilgamesh.cheme.cmu.edu 546037.gilgamesh.cheme.cmu.edu 546678.gilgamesh.cheme.cmu.edu,varattr=,rectime=1337609241\n')

* find jobs
#+BEGIN_SRC python :results output
from torque import PBS
pbs = PBS()
pbs.fastpoll()
print pbs.findjobs(euser='jkitchin')
#+END_SRC

#+RESULTS:
: [{'euser': 'jkitchin', 'job_state': 'Q', 'queue': 'short', 'resources_used.cput': '0', 'Job Id': '546726.gilgamesh', 'Job_Name': 'rutile1.py'}, {'euser': 'jkitchin', 'job_state': 'Q', 'queue': 'short', 'resources_used.cput': '0', 'Job Id': '546727.gilgamesh', 'Job_Name': 'rutile-vasp.py'}]

#+BEGIN_SRC python :results output

#+END_SRC
